In [1]:
import pandas as pd

In [2]:
dict1={'Name':['Priyank','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana'],
      'Marks':[98,89,99,87,90,83,99],
      'Gender':['Male','Female','Female','Male','Male','Female','Female']}

df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyank     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1.Top Three Rows of the Data set

In [3]:
df1.head(3)    #In parameter we can pass any number that many rows will be printed from top

      Name  Marks  Gender
0  Priyank     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2.Last Three Rows of the Data Set

In [4]:
df1.tail(3) #In the argument we have pass 3 due to which it shows last 3 rows of the data set

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 3.Find Shape of Our Data Set (Number of Rows and Columns)

In [6]:
df1.shape  ##Please remember shape is not a method it is a attribute in python that return a tupple containig rows and cols

(7, 3)

In [7]:
print("Number of Rows :",df1.shape[0])
print("Number of Columns:",df1.shape[1])

Number of Rows : 7
Number of Columns: 3

# 4.Get Information about Data Set like Total number of rows and columns,data type of each columns

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# 5.Check Null values in the data Set

In [9]:
df1.isnull().sum(axis=0)  ##Here it is displaying count of null values column wise when we pass axis=0

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
df1.isnull().sum(axis=1)  #Here it has retuned count of null values row wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# 6.Get overall statistics about the data Frame

In [11]:
df1.describe() ## without parameter this describe() method just show stattistic value for integer column type

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [12]:
df1.describe(include='all') # Here when we have used include='all' then it will show statistics about all columns

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyank        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 7.Find Unique values from the Gender column

In [13]:
df1['Gender'].unique() #This displays unique value of the Gender colum

array(['Male', 'Female'], dtype=object)

# 8.Find the number of Unique values from the Gender column

In [14]:
df1['Gender'].nunique() ##This display unique values fro the Gender column that is male and female

2

# 9.Display Count of Unique values from The Gender Column

In [15]:
df1['Gender'].value_counts()  ## This display count of unique value of column where female is 4 times and male is 3 time

Female    4
Male      3
Name: Gender, dtype: int64

# 10.Find Number of student having marks between 90 to 100 (both inclusive)using between method() and normally

In [16]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyank     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [17]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [18]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [19]:
sum(df1['Marks'].between(90,100)) ## Here it has summmed up all true values which is equal to 4

4

# 11.Find the average , minimum and maximum marks

In [20]:
df1['Marks'].mean()

92.14285714285714

In [22]:
df1['Marks'].max()

99

In [23]:
df1['Marks'].min()

83

# 12. Apply method

In [26]:
def half_the_marks(x):
    return x/2

df1['Half_Marks']=df1['Marks'].apply(half_the_marks)

df1

      Name  Marks  Gender  Half_Marks
0  Priyank     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5